# IsValidHost Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarHostData..::..IsValidHost Method
RebarHostData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidHost()()()() | Reports whether the element is a valid rebar host. |
| IsValidHost(Element) | Identifies whether a given element can host reinforcement. |

# See Also
RebarHostData Class
RebarHostData Members
Autodesk.Revit.DB.Structure Namespace